In [2]:
# Introduction to dataframes in pandas
import numpy as np
import pandas as pd

In [3]:
# Dataframes: overview - Its a 2 dimensional data type in a tabular format.

In [4]:
data = {'apples': [3,2,0,1], 'oranges': [0,3,7,2]}

In [6]:
purchases = pd.DataFrame(data)

In [7]:
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [8]:
# req - Need to add custom indexes to it.

In [9]:
purchases = pd.DataFrame(data, index=['ujwal', 'prakash', 'rishika', 'disha'])

purchases

         apples  oranges
ujwal         3        0
prakash       2        3
rishika       0        7
disha         1        2

In [10]:
# I want to locate disha's purchases --- 'loc' is the method to be used, stands for location.

In [11]:
purchases.loc['disha']

apples     1
oranges    2
Name: disha, dtype: int64

In [13]:
purchases.loc['ujwal']

apples     3
oranges    0
Name: ujwal, dtype: int64

In [14]:
# Moving on to the dataset implementations --

In [15]:
# Reading the data from the CSV files.
# CSV stands for comma saperated value file.

In [17]:
df = pd.read_csv('purchases.csv')

In [18]:
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [19]:
df = pd.read_csv('purchases.csv', index_col=0) # Removes the system generated indexes.

In [20]:
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [21]:
# File format json -- Key value pair combination
# JSON stands for java script object notion

In [22]:
df = pd.read_json('purchases.json')

In [23]:
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [24]:
# Raw data----
# Pre processing or cleansing of the data --- it is an intermediatory stage.

In [25]:
# How to store the data---

In [26]:
df.to_json('new_purchases.json')

In [28]:
df.to_csv('new_purchases.json')